IRP/src/InformationRegisters/ChequeBondStatuses/ChequeBondStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ChequeBondStatuses</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Status</name>
    <type>
      <types>CatalogRef.ObjectStatuses</types>
    </type>
  </resources>
  <dimensions>
    <name>Cheque</name>
    <type>
      <types>CatalogRef.ChequeBonds</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

IRP/src/AccumulationRegisters/PartnerApTransactions/PartnerApTransactions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>PartnerApTransactions</name>
  <resources>
    <name>Amount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <attributes>
    <name>DeferredCalculation</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>BasisDocument</name>
    <type>
      <types>DefinedType.typeApTransactionBasises</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Partner</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </dimensions>
  <dimensions>
    <name>LegalName</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Agreement</name>
    <type>
      <types>CatalogRef.Agreements</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CurrencyMovementType</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

IRP/src/AccumulationRegisters/PartnerArTransactions/PartnerArTransactions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>PartnerArTransactions</name>
  <resources>
    <name>Amount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <attributes>
    <name>DeferredCalculation</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>BasisDocument</name>
    <type>
      <types>DefinedType.typeArTransactionBasises</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Partner</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </dimensions>
  <dimensions>
    <name>LegalName</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Agreement</name>
    <type>
      <types>CatalogRef.Agreements</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CurrencyMovementType</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

IRP/src/Enums/DocumentPostingTypes/DocumentPostingTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>DocumentPostingTypes</name>
 <enumValues>
  <name>Posting</name>
 </enumValues>
 <enumValues>
  <name>Reversal</name>
 </enumValues>
 <enumValues>
  <name>Nothing</name>
 </enumValues>
 <enumValues>
  <name>Correction</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Documents/ChequeBondTransaction/ChequeBondTransaction.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ChequeBondTransaction</name>
  <registerRecords>InformationRegister.ChequeBondStatuses</registerRecords>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ChequeBonds</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Cheque</name>
      <type>
        <types>CatalogRef.ChequeBonds</types>
      </type>
    </attributes>
    <attributes>
      <name>Status</name>
      <type>
        <types>CatalogRef.ObjectStatuses</types>
      </type>
    </attributes>
    <attributes>
      <name>Partner</name>
      <type>
        <types>CatalogRef.Partners</types>
      </type>
    </attributes>
    <attributes>
      <name>Agreement</name>
      <type>
        <types>CatalogRef.Agreements</types>
      </type>
    </attributes>
    <attributes>
      <name>LegalName</name>
      <type>
        <types>CatalogRef.Companies</types>
      </type>
    </attributes>
    <attributes>
      <name>CashAccount</name>
      <type>
        <types>CatalogRef.CashAccounts</types>
      </type>
    </attributes>
    <attributes>
      <name>Bank</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>NewStatus</name>
      <type>
        <types>CatalogRef.ObjectStatuses</types>
      </type>
    </attributes>
    <attributes>
      <name>Currency</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>PaymentList</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>PartnerArBasisDocument</name>
      <type>
        <types>DefinedType.typeArTransactionBasises</types>
      </type>
    </attributes>
    <attributes>
      <name>PartnerApBasisDocument</name>
      <type>
        <types>DefinedType.typeApTransactionBasises</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Currencies</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>CurrencyFrom</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Rate</name>
      <type>
        <types>DefinedType.typeCurrencyRate</types>
      </type>
    </attributes>
    <attributes>
      <name>ReverseRate</name>
      <type>
        <types>DefinedType.typeCurrencyRate</types>
      </type>
    </attributes>
    <attributes>
      <name>ShowReverseRate</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Multiplicity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MovementType</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/Catalogs/Agreements/Agreements.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>Agreements</name>
 <attributes>
  <name>Number</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>30</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>Date</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>PartnerSegment</name>
  <type>
   <types>CatalogRef.PartnerSegments</types>
  </type>
 </attributes>
 <attributes>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>PriceType</name>
  <type>
   <types>CatalogRef.PriceTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>ItemSegment</name>
  <type>
   <types>CatalogRef.ItemSegments</types>
  </type>
 </attributes>
 <attributes>
  <name>StartUsing</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>EndOfUse</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>ManagerSegment</name>
  <type>
   <types>CatalogRef.PartnerSegments</types>
  </type>
 </attributes>
 <attributes>
  <name>PriceIncludeTax</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>DaysBeforeDelivery</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>2</precision>
   </numberQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>Store</name>
  <type>
   <types>CatalogRef.Stores</types>
  </type>
 </attributes>
 <attributes>
  <name>Type</name>
  <type>
   <types>EnumRef.AgreementTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>LegalName</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>CurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </attributes>
 <attributes>
  <name>ApArPostingDetail</name>
  <type>
   <types>EnumRef.ApArPostingDetail</types>
  </type>
 </attributes>
 <attributes>
  <name>StandardAgreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </attributes>
 <attributes>
  <name>Kind</name>
  <type>
   <types>EnumRef.AgreementKinds</types>
  </type>
 </attributes>
 <attributes>
  <name>UseCreditLimit</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>CreditLimitAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </attributes>
 <attributes>
  <name>PaymentTerm</name>
  <type>
   <types>CatalogRef.PaymentSchedules</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentFeeType</name>
  <type>
   <types>EnumRef.TradeAgentFeeTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentFeePercent</name>
  <type>
   <types>DefinedType.typePercent</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentFeeItem</name>
  <type>
   <types>CatalogRef.Items</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentFeeItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentFeeProfitLossCenter</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentFeeExpenseRevenueType</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>RecordPurchasePrices</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>Account</name>
  <type>
   <types>CatalogRef.PartnersBankAccounts</types>
  </type>
 </attributes>
 <attributes>
  <name>UseOrdersForSettlements</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/ChequeBonds/ChequeBonds.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>ChequeBonds</name>
 <attributes>
  <name>Type</name>
  <type>
   <types>EnumRef.ChequeBondTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>DueDate</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </attributes>
 <attributes>
  <name>Amount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </attributes>
 <attributes>
  <name>ChequeSerialNo</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>3</length>
   </stringQualifiers>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/CommonModules/DocChequeBondTransactionServer/Module.bsl
#Region FormEvents
Procedure OnCreateAtServer(Object, Form, Cancel, StandardProcessing) Export
	DocumentsServer.OnCreateAtServer(Object, Form, Cancel, StandardProcessing);
	
	ArrayTypes = New Array();
	ArrayTypes.Add(Type("DocumentRef.PurchaseReturn"));
	ArrayTypes.Add(Type("DocumentRef.SalesInvoice"));
	Form.Items.PaymentListPartnerArBasisDocument.TypeRestriction = New TypeDescription(ArrayTypes);
	
	ArrayTypes = New Array();
	ArrayTypes.Add(Type("DocumentRef.PurchaseInvoice"));
	ArrayTypes.Add(Type("DocumentRef.SalesReturn"));
	Form.Items.PaymentListPartnerApBasisDocument.TypeRestriction = New TypeDescription(ArrayTypes);
	
EndProcedure

Procedure OnWriteAtServer(Object, Form, Cancel, CurrentObject, WriteParameters) Export
	DocumentsServer.OnWriteAtServer(Object, Form, Cancel, CurrentObject, WriteParameters);
EndProcedure

Procedure OnReadAtServer(Object, Form, CurrentObject) Export
	DocumentsServer.OnReadAtServer(Object, Form, CurrentObject);
EndProcedure

#EndRegion

#Region Common
Function CheckRowChequeBond(Status, CashAccount) Export
	If ValueIsFilled(Status) Then
		PostingData = ObjectStatusesServer.PutStatusPostingToStructure(Status);
		Return Not ValueIsFilled(CashAccount) 
				And Not (PostingData.PlaningCashTransactions = PredefinedValue("Enum.DocumentPostingTypes.Nothing")
				And PostingData.AccountBalance = PredefinedValue("Enum.DocumentPostingTypes.Nothing"));
	Else
		Return True;
	EndIf;
EndFunction

Function GetChequeInfo(ChequeBondTransactionRef, ChequeRef) Export
	InfoStructure = New Structure("Status, Amount, NewStatus, Currency");
	If ValueIsFilled(ChequeRef) Then
		InfoStructure.Status = ObjectStatusesServer.GetLastStatusInfoByCheque(
				New Boundary(ChequeBondTransactionRef.Date, BoundaryType.Excluding), ChequeRef).Status;
		If Not ValueIsFilled(InfoStructure.Status) Then		
			InfoStructure.NewStatus = ObjectStatusesServer.GetStatusByDefaultForCheque(ChequeRef);
		EndIf;
		
		InfoStructure.Amount = ChequeRef.Amount;
	EndIf;
	InfoStructure.Currency = ChequeRef.Currency;
	Return InfoStructure;
EndFunction

Procedure GetPaymentListFillingData(ChequeBondTransactionRef, Parameters) Export

	Query = New Query;
	Query.Text =
		"SELECT
		|	ChequeBondStatusesSliceLast.Cheque,
		|	ChequeBondStatusesSliceLast.Recorder
		|INTO TT_Transactions
		|FROM
		|	InformationRegister.ChequeBondStatuses.SliceLast(,
		|	NOT Recorder = &ChequeBondTransactionRef
		|	AND Cheque = &Cheque) AS ChequeBondStatusesSliceLast
		|WHERE
		|	ChequeBondStatusesSliceLast.Status = &Status
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	ChequeBondTransactionChequeBonds.Key,
		|	TT_Transactions.Recorder
		|INTO TT_RowKeys
		|FROM
		|	TT_Transactions AS TT_Transactions
		|		INNER JOIN Document.ChequeBondTransaction.ChequeBonds AS ChequeBondTransactionChequeBonds
		|		ON ChequeBondTransactionChequeBonds.Ref = TT_Transactions.Recorder
		|		AND ChequeBondTransactionChequeBonds.Cheque = TT_Transactions.Cheque
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	ChequeBondTransactionPaymentList.PartnerArBasisDocument,
		|	ChequeBondTransactionPaymentList.PartnerApBasisDocument,
		|	ChequeBondTransactionPaymentList.Amount
		|FROM
		|	Document.ChequeBondTransaction.PaymentList AS ChequeBondTransactionPaymentList
		|		INNER JOIN TT_RowKeys AS TT_RowKeys
		|		ON TT_RowKeys.Recorder = ChequeBondTransactionPaymentList.Ref
		|		AND TT_RowKeys.Key = ChequeBondTransactionPaymentList.Key";
	
	Query.SetParameter("Cheque"						, Parameters.Cheque);
	Query.SetParameter("Status"						, Parameters.Status);
	Query.SetParameter("ChequeBondTransactionRef"	, ChequeBondTransactionRef);
	
	QueryResult = Query.Execute();
	
	If QueryResult.IsEmpty() Then
		Return;
	EndIf;
	 
	SelectionDetailRecords = QueryResult.Select();
	While SelectionDetailRecords.Next() Do
		NewRow = Parameters.PaymentList.Add();
		NewRow.Key = Parameters.Key;
		FillPropertyValues(NewRow, SelectionDetailRecords);
	EndDo;

EndProcedure

Function  InvalidDocuments(ControlStructure) Export

	Query = New Query();
	Query.Text = "SELECT
		|	PartnerApTransactionsBalance.BasisDocument,
		|	PartnerApTransactionsBalance.AmountBalance,
		|	PartnerApTransactionsBalance.Company,
		|	PartnerApTransactionsBalance.Currency,
		|	PartnerApTransactionsBalance.LegalName,
		|	PartnerApTransactionsBalance.Agreement,
		|	PartnerApTransactionsBalance.Partner
		|FROM
		|	AccumulationRegister.PartnerApTransactions.Balance(&EndDate,) AS PartnerApTransactionsBalance
		|WHERE
		|	PartnerApTransactionsBalance.BasisDocument IN (&BasisDocuments)
		|	AND (Not PartnerApTransactionsBalance.Partner = &Partner
		|	OR Not PartnerApTransactionsBalance.LegalName = &LegalName
		|	OR Not PartnerApTransactionsBalance.Agreement = &Agreement
		|	OR CASE  WHEN &UseCurrencyFilter THEN Not PartnerApTransactionsBalance.Currency = &Currency ELSE TRUE END
		|	OR Not PartnerApTransactionsBalance.Company = &Company)
		|
		|UNION ALL
		|
		|SELECT
		|	PartnerArTransactionsBalance.BasisDocument,
		|	PartnerArTransactionsBalance.AmountBalance,
		|	PartnerArTransactionsBalance.Company,
		|	PartnerArTransactionsBalance.Currency,
		|	PartnerArTransactionsBalance.LegalName,
		|	PartnerArTransactionsBalance.Agreement,
		|	PartnerArTransactionsBalance.Partner
		|FROM
		|	AccumulationRegister.PartnerArTransactions.Balance(&EndDate,) AS PartnerArTransactionsBalance
		|WHERE
		|	PartnerArTransactionsBalance.BasisDocument IN (&BasisDocuments)
		|	AND (Not PartnerArTransactionsBalance.Partner = &Partner
		|	OR Not PartnerArTransactionsBalance.LegalName = &LegalName
		|	OR Not PartnerArTransactionsBalance.Agreement = &Agreement
		|	OR CASE  WHEN &UseCurrencyFilter THEN Not PartnerArTransactionsBalance.Currency = &Currency ELSE TRUE END
		|	OR Not PartnerArTransactionsBalance.Company = &Company)"; 

	Query.SetParameter("BasisDocuments", ControlStructure.ControlDocument);
	Query.SetParameter("Company", ControlStructure.Company);
	Query.SetParameter("Partner", ControlStructure.Partner);
	Query.SetParameter("LegalName", ControlStructure.LegalName);
	Query.SetParameter("Agreement", ControlStructure.Agreement);
	Query.SetParameter("Currency", ControlStructure.Currency);
	Query.SetParameter("UseCurrencyFilter", ControlStructure.UseCurrencyFilter);
	Query.SetParameter("EndDate", ControlStructure.EndDate);
	
	Return Query.Execute().Unload().UnloadColumn("BasisDocument");

EndFunction

Function  InvalidAgreements(Agreements, Company) Export

Query = New Query;
Query.Text =
	"SELECT
	|	Agreements.Ref
	|FROM
	|	Catalog.Agreements AS Agreements
	|WHERE
	|	Agreements.Ref IN (&Agreements)
	|	AND Not Agreements.Company IN (VALUE(Catalog.Companies.EmptyRef), &Company)";

Query.SetParameter("Agreements", Agreements);
Query.SetParameter("Company", Company);

	Return Query.Execute().Unload().UnloadColumn("Ref");

EndFunction
Function CurrencyOnChange(ChequeBonds, Currency) Export
	
	Return Catalogs.ChequeBonds.CheckChequeBondsOfCurrency(ChequeBonds, Currency);
	
EndFunction
#EndRegion

#Region ListFormEvents

Procedure OnCreateAtServerListForm(Form, Cancel, StandardProcessing) Export
	DocumentsServer.OnCreateAtServerListForm(Form, Cancel, StandardProcessing);
EndProcedure

#EndRegion

#Region ChoiceFormEvents

Procedure OnCreateAtServerChoiceForm(Form, Cancel, StandardProcessing) Export
	DocumentsServer.OnCreateAtServerChoiceForm(Form, Cancel, StandardProcessing);
EndProcedure

#EndRegion
